lvgl-micropython/lvgl_micropython/micropy_updates/stm32/spi.c
void spi_deinit_all(void) {
    for (int i = 0; i < MP_ARRAY_SIZE(spi_obj); i++) {
        const spi_t *spi = &spi_obj[i];
        if (spi->spi != NULL && !MICROPY_HW_SPI_IS_RESERVED(i + 1) && !MICROPY_HW_SPI_IS_STATIC(i + 1)) {
            spi_deinit(spi);
        }
    }
}

static HAL_StatusTypeDef spi_wait_dma_finished(const spi_t *spi, uint32_t t_start, uint32_t timeout) {
    volatile HAL_SPI_StateTypeDef *state = &spi->spi->State;
    for (;;) {
        // Do an atomic check of the state; WFI will exit even if IRQs are disabled
        uint32_t irq_state = disable_irq();
        if (*state == HAL_SPI_STATE_READY) {
            enable_irq(irq_state);
            return HAL_OK;
        }
        __WFI();
        enable_irq(irq_state);
        if (HAL_GetTick() - t_start >= timeout) {
            return HAL_TIMEOUT;
        }
    }
    return HAL_OK;
}


static mp_lcd_spi_bus_obj_t *sending_device;

static void DMATransmitCplt(DMA_HandleTypeDef *hdma) {
    HAL_StatusTypeDef status = HAL_SPI_UnRegisterCallback(hdma, HAL_SPI_TX_COMPLETE_CB_ID);

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }

    spi_t *spi_obj = (spi_t *)sending_device->spi_device->spi_bus->user_data;
    dma_deinit(spi_obj->tx_dma_descr);

    sending_device.dma_callback(sending_device);
    sending_device = NULL;
}

void spi_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest, uint32_t timeout) {
    // Note: there seems to be a problem sending 1 byte using DMA the first
    // time directly after the SPI/DMA is initialised.  The cause of this is
    // unknown but we sidestep the issue by using polling for 1 byte transfer.

    // Note: DMA transfers are limited to 65535 bytes at a time.
    mp_machine_hw_spi_device_obj_t *self;

    if (self_in->base.type == &mp_machine_hw_spi_device_type) {
        self = (mp_machine_hw_spi_device_obj_t *)self_in;
    } else if (self_in->base.type == &mp_lcd_spi_bus_type) {
        while (sending_device != NULL) { }

        sending_device = (mp_lcd_spi_bus_obj_t *)self_in;
        self = sending_device->spi_device;
    } else {
        return;
    }

    const spi_t *spi_obj = (const spi_t *)self->spi_bus->user_data;

    HAL_StatusTypeDef status;
    void *odest = dest; // Original values of dest & len
    size_t olen = len;

    if (dest == NULL) {
        // send only
        if (
            len == 1 && (sending_device == NULL || !sending_device->use_dma) ||
            (query_irq() == IRQ_STATE_DISABLED && (sending_device == NULL || !sending_device->use_dma)) {
            status = HAL_SPI_Transmit(spi_obj->spi, (uint8_t *)src, len, timeout);
        } else {
            if (sending_device != NULL && sending_device->use_dma) {
                status = HAL_SPI_RegisterCallback(spi_obj->spi, HAL_SPI_TX_COMPLETE_CB_ID, &DMATransmitCplt);

                if (status != HAL_OK) {
                    mp_hal_raise(status);
                }
            }

            DMA_HandleTypeDef tx_dma;
            dma_init(&tx_dma, spi_obj->tx_dma_descr, DMA_MEMORY_TO_PERIPH, spi_obj->spi);
            spi_obj->spi->hdmatx = &tx_dma;
            spi_obj->spi->hdmarx = NULL;
            MP_HAL_CLEAN_DCACHE(src, len);
            uint32_t t_start = HAL_GetTick();
            do {
                uint32_t l = MIN(len, 65535);
                status = HAL_SPI_Transmit_DMA(spi_obj->spi, (uint8_t *)src, l);
                if (status != HAL_OK) {
                    break;
                }
                if (sending_device == NULL) {
                    status = spi_wait_dma_finished(spi_obj, t_start, timeout);
                    if (status != HAL_OK) {
                        break;
                    }
                }
                len -= l;
                src += l;
            } while (len);

            if (sending_device == NULL) {
                dma_deinit(spi_obj->tx_dma_descr);
            }
        }
    } else if (src == NULL) {
        // receive only
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_Receive(spi_obj->spi, dest, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma, rx_dma;
            if (spi_obj->spi->Init.Mode == SPI_MODE_MASTER) {
                // in master mode the HAL actually does a TransmitReceive call
                dma_init(&tx_dma, spi_obj->tx_dma_descr, DMA_MEMORY_TO_PERIPH, spi_obj->spi);
                spi_obj->spi->hdmatx = &tx_dma;
            } else {
                spi_obj->spi->hdmatx = NULL;
            }
            dma_init(&rx_dma, spi_obj->rx_dma_descr, DMA_PERIPH_TO_MEMORY, spi_obj->spi);
            spi_obj->spi->hdmarx = &rx_dma;
            dma_protect_rx_region(dest, len);
            uint32_t t_start = HAL_GetTick();
            do {
                uint32_t l = MIN(len, 65535);
                status = HAL_SPI_Receive_DMA(spi_obj->spi, dest, l);
                if (status != HAL_OK) {
                    break;
                }
                status = spi_wait_dma_finished(spi_obj, t_start, timeout);
                if (status != HAL_OK) {
                    break;
                }
                len -= l;
                dest += l;
            } while (len);
            if (spi_obj->spi->hdmatx != NULL) {
                dma_deinit(spi_obj->tx_dma_descr);
            }
            dma_deinit(spi_obj->rx_dma_descr);
            dma_unprotect_rx_region(odest, olen);
        }
    } else {
        // send and receive
        if (len == 1 || query_irq() == IRQ_STATE_DISABLED) {
            status = HAL_SPI_TransmitReceive(spi_obj->spi, (uint8_t *)src, dest, len, timeout);
        } else {
            DMA_HandleTypeDef tx_dma, rx_dma;
            dma_init(&tx_dma, spi_obj->tx_dma_descr, DMA_MEMORY_TO_PERIPH, spi_obj->spi);
            spi_obj->spi->hdmatx = &tx_dma;
            dma_init(&rx_dma, spi_obj->rx_dma_descr, DMA_PERIPH_TO_MEMORY, spi_obj->spi);
            spi_obj->spi->hdmarx = &rx_dma;
            MP_HAL_CLEAN_DCACHE(src, len);
            dma_protect_rx_region(dest, len);
            uint32_t t_start = HAL_GetTick();
            do {
                uint32_t l = MIN(len, 65535);
                status = HAL_SPI_TransmitReceive_DMA(spi_obj->spi, (uint8_t *)src, dest, l);
                if (status != HAL_OK) {
                    break;
                }
                status = spi_wait_dma_finished(spi_obj, t_start, timeout);
                if (status != HAL_OK) {
                    break;
                }
                len -= l;
                src += l;
                dest += l;
            } while (len);
            dma_deinit(spi_obj->tx_dma_descr);
            dma_deinit(spi_obj->rx_dma_descr);
            dma_unprotect_rx_region(odest, olen);
        }
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
}

void spi_print(const mp_print_t *print, const spi_t *spi_obj, bool legacy) {
    SPI_HandleTypeDef *spi = spi_obj->spi;

    uint spi_num = 1; // default to SPI1
    if (0) {
    }
    #if defined(SPI2)
    else if (spi->Instance == SPI2) {
        spi_num = 2;
    }
    #endif
    #if defined(SPI3)
    else if (spi->Instance == SPI3) {
        spi_num = 3;
    }
    #endif
    #if defined(SPI4)
    else if (spi->Instance == SPI4) {
        spi_num = 4;
    }
    #endif
    #if defined(SPI5)
    else if (spi->Instance == SPI5) {
        spi_num = 5;
    }
    #endif
    #if defined(SPI6)
    else if (spi->Instance == SPI6) {
        spi_num = 6;
    }
    #endif
    #if defined(MICROPY_HW_SUBGHZSPI_ID)
    else if (spi->Instance == SUBGHZSPI) {
        spi_num = MICROPY_HW_SUBGHZSPI_ID;
    }
    #endif

